InformationRegisters/EDEventsLog.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>EDEventsLog</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>EDOwner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDUsageAgreements</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Date</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>User</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>EDStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.EDStatuses</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DeleteEDStatus</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Responsible</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Comment</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>AttachedFile</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EDAttachedFiles</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>RecNo</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/EDStatuses.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>EDStatuses</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Canceled</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Delivered</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ConfirmationDelivered</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Executed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CardFile2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotSent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotReceived</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotFormed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Processed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RefusedABC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Rejected</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RejectedByBank</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RejectedByReceiver</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Sent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AdviseSent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ConfirmationSent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CancellationOfferSent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationSent</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferError</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AttributesError</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>TransferedToOperator</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PreparedToSending</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationPrepared</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ConfirmationPrepared</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Confirmed</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DigitallySigned</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FullyDigitallySigned</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Received</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NotificationReceived</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ConfirmationReceived</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReceivedOperatorConfirmation</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CancellationOfferReceived</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>AnnouncementReceived</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Accepted</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Suspended</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Created</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CancellationOfferCreated</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Approved</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PartlyDigitallySigned</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ESNotCorrect</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/EDEventsLog/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// SERVICE PROCEDURES AND FUNCTIONS

////////////////////////////////////////////////////////////////////////////////
// Info base update

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

// Handler of the update BED 1.1.3.7
// EDStatus attribute type modified in RS EDEventLogMonitor since a string on EnumRef.
Procedure UpdateEDStatuses() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	EDEventsLog.DeleteEDStatus,
	|	EDEventsLog.AttachedFile,
	|	EDEventsLog.RecNo
	|FROM
	|	InformationRegister.EDEventsLog AS EDEventsLog
	|WHERE
	|	EDEventsLog.DeleteEDStatus <> """"";
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		
		RecordManager                    = InformationRegisters.EDEventsLog.CreateRecordManager();
		RecordManager.AttachedFile = Selection.AttachedFile;
		RecordManager.RecNo        = Selection.RecNo;
		RecordManager.Read();
		
		If Selection.DeleteEDStatus = "Delivered to recipient" Then
			DeleteEDStatus = Enums.EDStatuses.Delivered;
		ElsIf Selection.DeleteEDStatus = "<Not received>" Then
			DeleteEDStatus = Enums.EDStatuses.NotReceived;
		ElsIf Selection.DeleteEDStatus = "<Not formed>" Then
			DeleteEDStatus = Enums.EDStatuses.NotFormed;
		ElsIf Selection.DeleteEDStatus = "Sent to recipient" Then
			DeleteEDStatus = Enums.EDStatuses.Sent;
		ElsIf Selection.DeleteEDStatus = "Specification notification has been sent" Then
			DeleteEDStatus = Enums.EDStatuses.NotificationSent;
		ElsIf Selection.DeleteEDStatus = "Sent to the EDO operator" Then
			DeleteEDStatus = Enums.EDStatuses.TransferedToOperator;
		ElsIf Selection.DeleteEDStatus = "Notification on specification is received" Then
			DeleteEDStatus = Enums.EDStatuses.AnnouncementReceived;
		Else
			DeleteEDStatus = StrReplace(Selection.DeleteEDStatus, " ", "");
			DeleteEDStatus = Enums.EDStatuses[DeleteEDStatus];
		EndIf;
		
		RecordManager.EDStatus = DeleteEDStatus;
		
		InfobaseUpdate.WriteData(RecordManager);
	EndDo;
	
EndProcedure

#EndIf
